---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings
source: html/cc9d7b07-a4d9-8570-9ed8-c953e241c0d6.htm
---
# Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings

Overriding settings applied to DirectContext3DHandles through the Visibility dialog.

## Syntax (C#)
```csharp
public class DirectContext3DHandleSettings : IDisposable
```

## Remarks
DirectContext3D graphics can be displayed with or without an associated DirectContext3D handle
 element. For DirectContext3D graphics that utilize the handle element, the visibility and appearance of
 the graphics can be adjusted through the Visibility/Graphics dialog.